<html>
<head>
<title>&Iacute;ndice Principal</title>
<meta http-equiv="Content-Type" 
      content="text/html; charset=iso-8859-1">
</head>

<!-- BeginBlock Cabecalho -->
<body bgcolor="#FFFFFF" text="#000000" background="Imagens/IPHS1_Fundo.jpg" link="#0066FF" vlink="#CC9933" alink="#00CC00">

<table border="0" Width="100%">
<tr>
    <td>
    <font size="3" color="#000099">
    IPHS1 para Windows
    </font>
    </td>
    
    <td>
    <a href="Index.htm">    
    <img src="Imagens/LARRW.GIF" 
         width="31" height="31" border="0" align="right"
         alt="Índice Principal">
    </a>
    </td>
</tr>
</table>
<br>
<!-- EndBlock Cabecalho -->

<b><font face="Times New Roman" size="6">
Janela Principal<br>
</font></b>

<br>
<center>
<FONT SIZE="2">
<P><img src="Janelas/JanelaPrincipal_2.jpg"></P>
<B>Figura 1: Janela Principal do IPHS1</B>
</FONT>
</center>

</B><P>Nela encontram-se alguns importantes elementos que comp&otilde;e a interface que permite o gerenciamento das diferentes opera&ccedil;&otilde;es proporcionadas pelo IPHS1: a <U>Barra de Menus</U>, a <U>Barra de Ferramentas Principal</U>, a <U>&Aacute;rea de Projeto</U>, a <U>Barra de Ferramentas Hidrogr&aacute;fica</U>, a <U>Caixa de T&iacute;tulo, Descri&ccedil;&atilde;o e Coment&aacute;rios</U>,  o <U>Gerenciador de Projeto</U> e a <U>Barra de Avisos</U>.</P>
<P>A <U>Barra de Menus</U> possibilita o acesso a todas as fun&ccedil;&otilde;es do IPHS1, algumas das quais est&atilde;o, tamb&eacute;m, disponibilizadas atrav&eacute;s da <U>Barra de Ferramentas Principal</U>. Ambas ser&atilde;o descritas minuciosamente no pr&oacute;ximo item.</P>
<P>A <U>&Aacute;rea de Projeto</U>, como j&aacute; foi dito acima, pode ser vista como uma <I>prancheta</I> onde podem ser desenhados os diferentes elementos que representam cada <I>Opera&ccedil;&atilde;o Hidrol&oacute;gica</I> que comp&otilde;e o <I>Projeto</I> em estudo, os quais podem estar ou n&atilde;o configurados na forma de uma <I>Rede Hidrogr&aacute;fica</I>. Al&eacute;m disso, conforme ser&aacute; visto, a <I><U>identifica&ccedil;&atilde;o do projeto</I></U> e outras informa&ccedil;&otilde;es de cunho geral s&atilde;o acessadas atrav&eacute;s da <U>&Aacute;rea de Projeto</U>.</P>
<P>A <U>Barra de Ferramentas Hidrogr&aacute;fica</U> cont&eacute;m os elementos capazes de possibilitar o lan&ccedil;amento na <I>&Aacute;rea de Projeto </I>das <I>Opera&ccedil;&otilde;es Hidrol&oacute;gicas</I> que ir&atilde;o caracterizar o <U>Projeto</U> a ser trabalhado. A <U>Caixa de T&iacute;tulo, Descri&ccedil;&atilde;o e Coment&aacute;rio</U>, como o pr&oacute;prio nome j&aacute; indica, permite ao usu&aacute;rio identificar o T&iacute;tulo, a Descri&ccedil;&atilde;o e o Coment&aacute;rio que deu a cada objeto inserido na <U>&Aacute;rea de Projeto</U>.</P>
<P>A janela do <U>Gerenciador de Projeto</U> cont&eacute;m, na forma de &aacute;rvore, a descri&ccedil;&atilde;o estruturada de todos os elementos que comp&otilde;e o <I>Projeto</I>, divididas em: <U>Pontos de Controle</U>, <U>Reservat&oacute;rios</U>, <U>Trechos de &Aacute;gua</U>, <U>Sub-bacias</U> e <U>Deriva&ccedil;&otilde;es</U>. Conforme se viu anteriormente no Cap&iacute;tulo 2, cada um desses elementos representam uma ou mais <I>Opera&ccedil;&otilde;es Hidrol&oacute;gicas</I>, pertencendo a um dos M&oacute;dulos do IPHS1: o <I> M&oacute;dulo Bacia</I> ou o <I>M&oacute;dulo Rio</I>, conforme ser&aacute; melhor visto a seguir.</P>

<h3>Menu Principal</h3>
<P>
<TABLE BORDER CELLSPACING=1 CELLPADDING=2>
    <TR>
	    <TD><IMG SRC="Imagens/Image3.jpg" WIDTH=30 HEIGHT=30> Novo <b>Ctrl + N</b></TD>
		<TD>Cria um <U>Novo Projeto</U>, apresentando sua <U>&Aacute;rea de Projetos</U>, vazia, na tela.</TD>
    </TR>

    <TR>
	    <TD><IMG SRC="Imagens/Image4.gif" WIDTH=29 HEIGHT=28> Abrir <b>Ctrl + A</b></TD>
		<TD>Abre um arquivo de Projeto existente.</TD>
    </TR>

	<TR>
	    <TD>Fechar</TD>
		<TD>Fecha um Projeto aberto.</TD>
	</TR>

	<TR>
	    <TD><IMG SRC="Imagens/Image5.jpg" WIDTH=30 HEIGHT=30> Salvar <b>Ctrl + S</b></TD>
		<TD>Salva o Projeto ativo.</TD>
	</TR>

	<TR>
		<TD>Salvar Como ...</TD>
		<TD>Salva um Projeto ativo com outro Nome e em qualquer Diret&oacute;rio...</TD>
	</TR>

	<TR>
		<TD>Fechar</TD>
		<TD>Fecha o arquivo de dados ativo.</TD>
	</TR>

	<TR>
		<TD>Sair <b>Ctrl + X</b></TD>
		<TD>Finaliza a opera&ccedil;&atilde;o do IPHS1.</TD>
	</TR>
	</TABLE>
</P>

<B><U>Menu Visualisar</U>:</B>
<P>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4>
	<TR>
		    <TD><IMG SRC="Imagens/Image6.gif"> Editor de Textos</TD>
			<TD>Abre o Editor de Textos do IPHS1.</TD>
	</TR>
	
	<TR>
		    <TD>Editor de Scripts</TD>
			<TD>Abre o Editor de Pascal Script.</TD>
	</TR>
	
	<TR>
		    <TD><IMG SRC="Imagens/Image7.jpg"> Gerenciador de Projeto</TD>
			<TD>Abre o Gerenciador de Projeto.</TD>
	</TR>

	<TR>
		    <TD>Gerenciador de Janelas</TD>
			<TD>Abre o Gerenciador de Janelas.</TD>
	</TR>
	
	<TR>
		    <TD>Mensagens</TD>
			<TD>Abre o Editor de Mensagens.</TD>
	</TR>
	
	<TR>
		    <TD>Vari&aacute;veis Globais do Script</TD>
			<TD>Abre o Gerenciador de Vari&aacute;veis Globais do Script</TD>
	</TR>
	</TABLE>
</P>

<B><U><P>Menu Projeto</U>:</P></B>
<P>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4>
	<TR>
		    <TD>Ler Imagem de Fundo</TD>
			<TD>L&ecirc; uma imagem .bmp para servir de fundo para a &Aacute;rea de Projeto.</TD>
	</TR>

	<TR>
		    <TD>Limpa Imagem de Fundo</TD>
			<TD>Permite remover uma imagem de fundo da &Aacute;rea de Projeto.</TD>
	</TR>

	<TR>
		    <TD><IMG SRC="Imagens/Image8.jpg"> Realizar diagn&oacute;stico completo</TD>
			<TD>Faz um diagn&oacute;stico completo da Rede Hidrogr&aacute;fica verificando sua consist&ecirc;ncia.</TD>
	</TR>

	<TR>
		    <TD><IMG SRC="Imagens/Image9.jpg"> Executar</TD>
			<TD>Executa o IPHS1 DOS.</TD>
	</TR>

	<TR>
		    <TD>Intervalos de An&aacute;lise</TD>
			<TD>Defini&ccedil;&atilde;o de intervalos de an&aacute;lise de resultados de simula&ccedil;&otilde;es.</TD>
	</TR>
</TABLE>
</P>

<B><U><P>Menu Janelas</U>:</P></B>
<P><TABLE BORDER CELLSPACING=1 CELLPADDING=4>
	<TR>
		    <TD><IMG SRC="Imagens/Image10.jpg"> Cascata</TD>
			<TD>Arruma, em cascata, as janelas de Projeto abertas.</TD>
	</TR>

	<TR>
		    <TD><IMG SRC="Imagens/Image11.jpg"> Arruma horizontalmente</TD>
			<TD>Arruma, horizontalmente, as janelas de Projeto abertas.</TD>
	</TR>

	<TR>
		    <TD><IMG SRC="Imagens/Image12.jpg"> Arruma verticamente</TD>
			<TD>Arruma, verticalmente, as janelas de Projeto abertas.</TD>
	</TR>

	<TR>
		    <TD>Minimizar todas</TD>
			<TD>Minimiza todas as janelas de Projetos ativos.</TD>
	</TR>

	<TR>
		    <TD>Arruma todas></TD>
			<TD>Organiza todas as janelas de Projetos abertos na tela de forma que n&atilde;o fiquem sobrepostas.</TD>
	</TR>
</TABLE>
</P>

<P>Menu Ajuda</U>:</P></B>
<P>
<TABLE BORDER CELLSPACING=1 CELLPADDING=2>
	<TR>
		    <TD>Ajuda</TD>
			<TD>Ainda n&atilde;o implementado – consulte o Manual.</TD>
	</TR>

	<TR>
		    <TD>Sobre o Sistema ...</TD>
			<TD>Descri&ccedil;&atilde;o sum&aacute;ria do sistema e da equipe de desenvolvimento.</TD>
	</TR>
</TABLE>
</P>

<!-- BeginBlock Rodape -->
<br>
<table border="0" Width="100%">
<tr>
    <td>
    <font size="3" color="#000099">
    IPHS1 para Windows
    </font>
    </td>
    
    <td>
    <a href="Index.htm">    
    <img src="Imagens/LARRW.GIF" 
         width="31" height="31" border="0" align="right"
         alt="Índice Principal">
    </a>
    </td>
</tr>
</table>
<!-- EndBlock Rodape -->
 
</body>
</html>
