<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
	<title>Primeiros Passos</title>
</head>

<!-- BeginBlock Cabecalho -->
<body bgcolor="#FFFFFF" text="#000000" background="Imagens/IPHS1_Fundo.jpg" link="#0066FF" vlink="#CC9933" alink="#00CC00">

<table border="0" Width="100%">
<tr>
    <td>
    <font size="3" color="#000099">
    IPHS1 para Windows
    </font>
    </td>
    
    <td>
    <a href="Index.htm">    
    <img src="Imagens/LARRW.GIF" 
         width="31" height="31" border="0" align="right"
         alt="Índice Principal">
    </a>
    </td>
</tr>
</table>
<br>
<!-- EndBlock Cabecalho -->

<b>
<font face="Times New Roman" size="6">
Primeiros Passos<br>
</font>
</b>

<h2>Cria&ccedil;&atilde;o, Abertura, Edi&ccedil;&atilde;o e Fechamento de um Projeto</h2>
<h3>Criando e Salvando um novo Projeto</h3>
</B><P>Para criar um projeto novo o usu&aacute;rio dever&aacute; proceder da seguinte forma:</P></DIR>
<LI>Escolher a op&ccedil;&atilde;o <U>Novo</U> (Ctrl + N) do Menu Arquivo ou o &iacute;cone correspondente na Barra de Ferramentas Principal.</LI>
<P>O acionamento desta op&ccedil;&atilde;o far&aacute; com que, imediatamente, seja aberta na tela uma janela denominada <I>&Aacute;rea de Projeto</I> <U>totalmente em branco</U> e que, como j&aacute; foi dito, dever&aacute; ser vista como uma prancheta de desenho onde o usu&aacute;rio ir&aacute; inserir os e<I>lementos representativos de Opera&ccedil;&otilde;es Hidrol&oacute;gicas</I> que desejar estudar.</P>
<LI>Preencher os <I>Dados de Identifica&ccedil;&atilde;o do Projeto</I>, atrav&eacute;s da abertura da janela <U>Dados do Projeto</U> com um <I>duplo clique</I> sobre a <I>&Aacute;rea de Projeto</I>.</LI>

<center>
<FONT SIZE=2>
<P><IMG SRC="Imagens/Image13.jpg"></P>
<B><P>&Aacute;rea de Projeto de um Novo Projeto.</P></B>
</FONT>
</center>

<P>A janela <U>Dados do Projeto</U>  cont&eacute;m um conjunto de campos com dados de documenta&ccedil;&atilde;o e informa&ccedil;&otilde;es necess&aacute;rias &agrave; opera&ccedil;&atilde;o adequada do Projeto.</P>

<center>
<FONT SIZE=2>
<P><IMG SRC="Imagens/Image14.jpg"></P>
<B><P>Janela de Dados do Projeto.</P></B>
</FONT>
</center>

<P>Os campos <I>Nome</I>, <I>Descri&ccedil;&atilde;o</I> e <I>Coment&aacute;rios</I> 
destinam-se, respectivamente, &agrave; identifica&ccedil;&atilde;o do Projeto, a uma 
pequena descri&ccedil;&atilde;o do mesmo e a quaisquer coment&aacute;rios que sejam 
necess&aacute;rios para identificar vers&otilde;es, hip&oacute;teses, alternativas, 
etc., de livre escolha do usu&aacute;rio. Pode-se observar que essas 
informa&ccedil;&otilde;es aparecem, na Figura 3, na Caixa de T&iacute;tulo 
Descri&ccedil;&atilde;o e Coment&aacute;rios.</P>

<P>Os campos <I>Diret&oacute;rio de Sa&iacute;da</I> e <I>Diret&oacute;rio de Pesquisa</I> 
correspondem, respectivamente, ao diret&oacute;rio onde ser&atilde;o armazenados os
 resultados das simula&ccedil;&otilde;es e ao diret&oacute;rio onde o IPHS1 
 encontrar&aacute; os arquivos de projeto, os arquivos de vaz&otilde;es e arquivos de 
 precipita&ccedil;&atilde;o necess&aacute;rios &agrave; opera&ccedil;&atilde;o do 
 Projeto.</P>
 
<P>O campo <I>Scripts</I> permite a inser&ccedil;&atilde;o de rotinas na linguagem Pascal 
Script destinadas a automatizar a an&aacute;lise de resultados a qual ser&aacute; objeto de 
maior explana&ccedil;&atilde;o em vers&otilde;es futuras do IPHS1. Pode, entretanto, ser 
utilizado por usu&aacute;rios j&aacute; familiarizados com a linguagem e com as 
fun&ccedil;&otilde;es disponibilizadas atrav&eacute;s do <I>Editor Pascal Script</I>.</P>
  
<P>Os campos <I>N&uacute;meros de Intervalos de Tempo, N&uacute;mero de Intervalos de 
Tempo com Chuva</I> e <I>Tamanho do Intervalo de Tempo</I> s&atilde;o auto-explicativos 
sendo que, os dois primeiros s&atilde;o medidos em unidades do &uacute;ltimo que, por sua 
vez, deve ser estabelecido em segundos.</P>

<P>O campo destinado a <I>Postos de Chuvas</I> dever&aacute; ser editado utilizando-se os 
bot&otilde;es <U>Adicionar</U> e <U>Remover</U>. O primeiro bot&atilde;o d&aacute; acesso a 
uma janela de seleçã de arquivos. Nela o usu&aacute;rio poder&aacute; 
selecionar em qualquer diret&oacute;rio o arquivo de chuva correspondente ao <I>Posto</I> 
que desejar.</P>

<IMG SRC="Imagens/Image15.jpg" ></P></B>

<P>Este arquivo consiste de um arquivo texto com tantos valores quantos os intervalos de 
tempo com chuvas indicados no campo <I>N&uacute;mero de Intervalos de Tempo com Chuva</I>, 
acima mencionado. Os dados podem ser escritos em qualquer ordem, de forma livre, desde que 
separados por um espa&ccedil;o. O separador decimal deve ser o ponto.</P>

<P>Inserido o <I>Posto</I> o usu&aacute;rio dever&aacute; indicar se os dados correspondem 
a uma (1) <I>Tormenta de Projeto Desagregada (mm/<FONT FACE="Symbol">&#68;</FONT>
T)</I> ou a uma (2) <I>Tormenta de Projeto Acumulada (mm)</I>. A forma de indicar isso 
&eacute; selecionando o <I>Posto de Chuva</I> com o mouse e &quot;clicando&quot; com o 
bot&atilde;o direito para abrir um menu suspenso, conforme ilustra a Figura 5, que, 
ent&atilde;o possibilita a sele&ccedil;&atilde;o.</P>

<center>
<FONT SIZE=2>
<IMG SRC="Imagens/Image16.jpg"><BR>
<B>Sele&ccedil;&atilde;o do tipo de chuva</B>
</FONT>
</center>

</B><P>Preenchidos os campos, total ou parcialmente, a op&ccedil;&atilde;o <U>OK</U> 
registrar&aacute; em mem&oacute;ria as escolhas feitas; a op&ccedil;&atilde;o 
<U>Cancelar</U>, por sua vez, desconsiderar&aacute; as altera&ccedil;&otilde;es 
realizadas. Para fazer a Edi&ccedil;&atilde;o dos Dados do Projeto, basta abrir 
novamente a janela, realizar as altera&ccedil;&otilde;es desejadas e, mais uma vez, 
teclar OK.</P>

<P>O bot&atilde;o <U>Rotinas do Usu&aacute;rio</U> possibilita 
que, ap&oacute;s a simula&ccedil;&atilde;o, seja executada uma rotina em 
<I>Pascal Script</I>. Da mesma forma como acima foi mencionado, maiores 
explica&ccedil;&otilde;es da aplica&ccedil;&atilde;o desta linguagem para an&aacute;lise 
de resultados do IPHS1, ser&atilde;o objeto de uma pr&oacute;xima vers&atilde;o, 
entretanto, os usu&aacute;rios j&aacute; familiarizados com a linguagem e com as 
fun&ccedil;&otilde;es que ir&atilde;o gradativamente sendo disponibilizadas atrav&eacute;s do <I>Editor Pascal Script</I> podem aproveitar sua potencialidade.</P>
Salvar o Novo Projeto atrav&eacute;s das op&ccedil;&otilde;es 

<!-- BeginBlock Rodape -->
<br>
<table border="0" Width="100%">
<tr>
    <td>
    <font size="3" color="#000099">
    IPHS1 para Windows
    </font>
    </td>
    
    <td>
    <a href="Index.htm">    
    <img src="Imagens/LARRW.GIF" 
         width="31" height="31" border="0" align="right"
         alt="Índice Principal">
    </a>
    </td>
</tr>
</table>
<!-- EndBlock Rodape -->

</body>
</html>
